def interpolSearch(A, elem):
    # если искомый элемент за границами диапазона,то делать нечего
    if elem ==

    # определим верхнюю границу и вызовем рекурсивную функцию
    # ...

def interpolSearchRec(A, elem, lo, hi):
    # если подмассив пустой ИЛИ elem за границами диапазона, то делать нечего
    # if ...

    # если левая и правая границы совпадают, то mid по формуле вычислять нельзя! (почему?)
    # if ...
    # иначе - вычисляем mid по формуле
    # mid = ...

    # выполняем сравнение и рекурсивный вызов на одной из частей
    # if ...